run/rhoVoF/rotateSubstrate/reducedCaseTestPLICaRDF/common/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//direct copy from jun
//this file declares the numeric schemes on how a mathmatical operation should be executed
//NOT VERIFIED, should be good for now


ddtSchemes
{
    default          Euler;
}

gradSchemes
{
    default          pointCellsLeastSquares;
}

divSchemes
{
    div(rhoPhi,U)    Gauss upwind; //limitedLinearV 1;
    div(phi,alpha)   Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default          Gauss linear corrected;
}

interpolationSchemes
{
    default          linear;
}

snGradSchemes
{
    default          corrected;
}

fluxRequired
{
    default          no;
    p_rgh;
    pcorr;
    alpha.water;
}


// ************************************************************************* //
